In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                    index = ['a', 'c', 'd'],
                     columns = ['oh', 'te', 'ca'])

In [7]:
frame

   oh  te  ca
a   0   1   2
c   3   4   5
d   6   7   8

In [8]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [9]:
frame2

    oh   te   ca
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [10]:
states = ['te', 'ut', 'ca']

In [11]:
frame.reindex(columns = states)

   te  ut  ca
a   1 NaN   2
c   4 NaN   5
d   7 NaN   8

In [15]:
frame.reindex(index = ['a', 'b', 'c', 'd'], columns = states)

    te  ut   ca
a  1.0 NaN  2.0
b  NaN NaN  NaN
c  4.0 NaN  5.0
d  7.0 NaN  8.0

In [16]:
obj = pd.Series(np.arange(5), index = ['a', 'b', 'c', 'd', 'e'])

In [17]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [18]:
new_obj = obj.drop('c')

In [19]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [20]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int32

In [22]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['oh', 'co', 'ut', 'ne'],
                   columns = ['one', 'two', 'three', 'four'])

In [23]:
data

    one  two  three  four
oh    0    1      2     3
co    4    5      6     7
ut    8    9     10    11
ne   12   13     14    15

In [24]:
data.drop(['co', 'oh'])

    one  two  three  four
ut    8    9     10    11
ne   12   13     14    15

In [25]:
data.drop('two', axis = 1)

    one  three  four
oh    0      2     3
co    4      6     7
ut    8     10    11
ne   12     14    15

In [26]:
data.drop(['two', 'four'], axis = 'columns')

    one  three
oh    0      2
co    4      6
ut    8     10
ne   12     14

In [27]:
obj = pd.Series(np.arange(4), index = ['a', 'b', 'c', 'd'])

In [28]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [29]:
obj['b']

1

In [30]:
obj[1]

1

In [31]:
obj[2: 4]

c    2
d    3
dtype: int32

In [32]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: int32

In [33]:
obj[[1, 3]]

b    1
d    3
dtype: int32

In [34]:
obj[obj < 2]

a    0
b    1
dtype: int32

In [35]:
obj['b': 'c']

b    1
c    2
dtype: int32

In [36]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['oh', 'co', 'ut', 'ne'],
                   columns = ['one', 'two', 'three', 'four'])

In [37]:
data

    one  two  three  four
oh    0    1      2     3
co    4    5      6     7
ut    8    9     10    11
ne   12   13     14    15

In [38]:
data['two']

oh     1
co     5
ut     9
ne    13
Name: two, dtype: int32

In [39]:
data[['three', 'one']]

    three  one
oh      2    0
co      6    4
ut     10    8
ne     14   12

In [40]:
data[['two']]

    two
oh    1
co    5
ut    9
ne   13

In [43]:
data.loc['oh']

one      0
two      1
three    2
four     3
Name: oh, dtype: int32

In [44]:
data[:1]

    one  two  three  four
oh    0    1      2     3

In [45]:
data.loc['co', ['two', 'three']]

two      5
three    6
Name: co, dtype: int32

In [46]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: ut, dtype: int32

In [47]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: ut, dtype: int32

In [49]:
ser = pd.Series(np.arange(3))

In [50]:
ser

0    0
1    1
2    2
dtype: int32

In [51]:
ser[-1]

KeyError: -1

In [52]:
ser2 = pd.Series(np.arange(3), index = ['a', 'b', 'c'])

In [54]:
ser2

a    0
b    1
c    2
dtype: int32

In [55]:
ser2[-1]

2

In [56]:
ser[:1]

0    0
dtype: int32

In [57]:
ser.loc[: 1]

0    0
1    1
dtype: int32

In [58]:
ser[:1]

0    0
dtype: int32

In [59]:
ser.loc[:1]

0    0
1    1
dtype: int32

In [60]:
ser.iloc[:1]

0    0
dtype: int32

In [61]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5],
              index = ['a', 'b', 'c', 'd'])

In [62]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
              index = ['a', 'c', 'e', 'f', 'g'])

In [63]:
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [64]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [65]:
s1 + s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [66]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)),
                  columns = list('abcd'))

In [69]:
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)),
                  columns = list('abcde'))

In [70]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [71]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [72]:
df2.loc[1, 'b'] = np.nan

In [73]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [74]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [80]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [81]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])

In [82]:
series2

b    0
e    1
f    2
dtype: int64

In [84]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                    columns = list('bde'),
                    index = ['ut', 'oh', 'te', 'or'])

In [85]:
frame

    b   d   e
ut  0   1   2
oh  3   4   5
te  6   7   8
or  9  10  11

In [86]:
frame + series2

      b   d     e   f
ut  0.0 NaN   3.0 NaN
oh  3.0 NaN   6.0 NaN
te  6.0 NaN   9.0 NaN
or  9.0 NaN  12.0 NaN

In [87]:
series3 = frame['d']

In [88]:
frame

    b   d   e
ut  0   1   2
oh  3   4   5
te  6   7   8
or  9  10  11

In [89]:
series3

ut     1
oh     4
te     7
or    10
Name: d, dtype: int32

In [92]:
frame.sub(series3, axis = 'index')

    b  d  e
ut -1  0  1
oh -1  0  1
te -1  0  1
or -1  0  1

In [93]:
f = lambda x: x.max() - x.min()

In [94]:
frame.apply(f)

b    9
d    9
e    9
dtype: int64

In [96]:
frame.apply(f, axis = 'columns')

ut    2
oh    2
te    2
or    2
dtype: int64

In [97]:
format = lambda x: '%.2f' % x

In [99]:
frame.applymap(format)

       b      d      e
ut  0.00   1.00   2.00
oh  3.00   4.00   5.00
te  6.00   7.00   8.00
or  9.00  10.00  11.00

In [100]:
frame['e']

ut     2
oh     5
te     8
or    11
Name: e, dtype: int32

In [101]:
frame['e'].map(format)

ut     2.00
oh     5.00
te     8.00
or    11.00
Name: e, dtype: object

In [102]:
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])

In [103]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [104]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [105]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index = ['three', 'one'],
                    columns = ['d', 'a', 'b', 'c'])

In [106]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [107]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [108]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [110]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [111]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [112]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [113]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [114]:
frame = pd.DataFrame({'b': [4, 7, -3, 2],
                     'a': [0, 1, 0, 1]})

In [115]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [116]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [117]:
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [118]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [119]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [122]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64